Revit 2027 API
ParameterTypeId.CurveHeightOffset Property
 "Offset From Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveHeightOffset { get; }
Public Shared ReadOnly Property CurveHeightOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveHeightOffset {
	ForgeTypeId^ get ();
}
static member CurveHeightOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace